[
  {
    "title": "Colorpal",
    "description": "A web app that I first created on the side while in college to learn new skills. It allows users to upload an image and extract its color palette. It makes use of a React client and a Python (Flask) REST API. The React client POSTs images to the Python REST API which then uses OpenCV, image processing techniques and K-Means Clustering to extract its palette and return it to the client.",
    "techStack": [
      "Python",
      "Flask",
      "OpenCV",
      "SkLearn",
      "Numpy",
      "JavaScript",
      "React",
      "Redux",
      "Styled Components",
      "Heroku"
    ],
    "repoLink": "https://github.com/markschnabel/colorpal",
    "image": "../src/images/projects/ColorPal.png"
  },
  {
    "title": "Photowall",
    "description": "A web app that I created as a test for my first software internship. It's supposed to be a public image board that allows users to upload an image, stores the images in AWS S3 and displays them on one public board everone can contribute to. This project helped me learn the basics of Ruby on Rails and Vue.",
    "techStack": [
      "Ruby on Rails",
      "Vue",
      "JavaScript",
      "Postgres",
      "AWS S3",
      "SemanticUI",
      "RSpec"
    ],
    "repoLink": "https://github.com/markschnabel/photowall",
    "image": "../src/images/projects/Photowall.png"
  },
  {
    "title": "OpenCV Motion Detector",
    "description": "A Python and OpenCV program that utilizes background subtraction to work as a motion detector. Can work with live-streamed video or pre-recorded video files.",
    "techStack": ["Python", "OpenCV"],
    "repoLink": "https://github.com/markschnabel/opencv-motion-detector",
    "image": "../src/images/projects/MotionDetector.jpg"
  },
  {
    "title": "Portfolio",
    "description": "The webiste you're on right now! I built this website to help showcase my projects and experience as an engineer. I built the site using Gatsby which let me write code in React which it turns into Static HTML/CSS/JS at compile time for increased load times and a lower bundle size. Components are automatically generated for the site using JSON and Gatsby's GraphQL query layer to allow for easy updates to content. The site is deployed to and hosted on Netlify.",
    "techStack": [
      "JavaScript",
      "React",
      "Gatsby",
      "GraphQL",
      "TailwindCSS",
      "CSS",
      "Netlify"
    ],
    "repoLink": "https://github.com/markschnabel/mark-schnabel-dot-com",
    "image": "../src/images/projects/Portfolio.png"
  }
]
